---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeTypeParam
source: html/87f69e88-bc72-c3b3-c294-cc6e61344f85.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeTypeParam Property

"Pipe Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeTypeParam { get; }
```